In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_excel("dataset.xlsx")
print(data)

     ord no  purch_amt   ord date  customer id  salesman id
0       NaN     270.65 2012-09-10         3001      5003.00
1   70002.0      65.26        NaT         3001      5001.00
2   70004.0     110.50 2012-08-17         3003          NaN
3       NaN     948.50 2012-09-10         3002      5002.00
4   70005.0    2400.60 2012-07-27         3001      5001.00
5       NaN    5760.00 2012-09-10         3001      5001.00
6   70010.0    1983.43 2012-10-10         3004          NaN
7   70003.0    2480.40 2012-10-10         3003      5003.00
8   70012.0     250.45 2012-06-27         3002      5002.00
9       NaN      75.29 2012-08-17         3001      5003.00
10      NaN     270.65 2012-09-10         3001      5003.00
11  70002.0      65.26        NaT         3001      5001.01
12  70004.0     110.50 2012-08-17         3003          NaN
13      NaN     948.50 2012-09-10         3002      5002.00
14  70006.0    2400.60 2012-07-27         3001      5001.00
15      NaN    5760.00 2012-09-10         3001      5001.00
16  70009.0    1983.43 2012-10-10         3004          NaN
17  70008.0    2480.40 2012-10-10         3003      5003.00
18  70011.0     250.45 2012-06-27         3002      5002.00
19      NaN      75.29 2012-08-17         3001      5003.00
20  70013.0    3045.60 2012-04-25         3001          NaN
21  70007.0     150.50 2012-10-05         3002      5002.00

In [6]:
data.dropna()

     ord no  purch_amt   ord date  customer id  salesman id
4   70005.0    2400.60 2012-07-27         3001       5001.0
7   70003.0    2480.40 2012-10-10         3003       5003.0
8   70012.0     250.45 2012-06-27         3002       5002.0
14  70006.0    2400.60 2012-07-27         3001       5001.0
17  70008.0    2480.40 2012-10-10         3003       5003.0
18  70011.0     250.45 2012-06-27         3002       5002.0
21  70007.0     150.50 2012-10-05         3002       5002.0

In [7]:
print(data)

     ord no  purch_amt   ord date  customer id  salesman id
0       NaN     270.65 2012-09-10         3001      5003.00
1   70002.0      65.26        NaT         3001      5001.00
2   70004.0     110.50 2012-08-17         3003          NaN
3       NaN     948.50 2012-09-10         3002      5002.00
4   70005.0    2400.60 2012-07-27         3001      5001.00
5       NaN    5760.00 2012-09-10         3001      5001.00
6   70010.0    1983.43 2012-10-10         3004          NaN
7   70003.0    2480.40 2012-10-10         3003      5003.00
8   70012.0     250.45 2012-06-27         3002      5002.00
9       NaN      75.29 2012-08-17         3001      5003.00
10      NaN     270.65 2012-09-10         3001      5003.00
11  70002.0      65.26        NaT         3001      5001.01
12  70004.0     110.50 2012-08-17         3003          NaN
13      NaN     948.50 2012-09-10         3002      5002.00
14  70006.0    2400.60 2012-07-27         3001      5001.00
15      NaN    5760.00 2012-09-10         3001      5001.00
16  70009.0    1983.43 2012-10-10         3004          NaN
17  70008.0    2480.40 2012-10-10         3003      5003.00
18  70011.0     250.45 2012-06-27         3002      5002.00
19      NaN      75.29 2012-08-17         3001      5003.00
20  70013.0    3045.60 2012-04-25         3001          NaN
21  70007.0     150.50 2012-10-05         3002      5002.00